Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
Convolution2D_236 (Conv2D)      (None, 112, 112, 32) 896         Input_1[0][0]                    
__________________________________________________________________________________________________
Convolution2D_235 (Conv2D)      (None, 112, 112, 32) 9248        Convolution2D_236[0][0]          
__________________________________________________________________________________________________
Convolution2D_237 (Conv2D)      (None, 110, 110, 64) 18496       Convolution2D_235[0][0]          
__________________________________________________________________________________________________
MaxPooling2D_69 (MaxPooling2D)  (None, 55, 55, 64)   0           Convolution2D_237[0][0]          
__________________________________________________________________________________________________
Convolution2D_238 (Conv2D)      (None, 53, 53, 80)   46160       MaxPooling2D_69[0][0]            
__________________________________________________________________________________________________
Convolution2D_239 (Conv2D)      (None, 26, 26, 192)  138432      Convolution2D_238[0][0]          
__________________________________________________________________________________________________
Convolution2D_1 (Conv2D)        (None, 26, 26, 32)   6176        Convolution2D_239[0][0]          
__________________________________________________________________________________________________
Convolution2D_4 (Conv2D)        (None, 26, 26, 64)   6208        Convolution2D_1[0][0]            
__________________________________________________________________________________________________
Convolution2D_2 (Conv2D)        (None, 26, 26, 32)   6176        Convolution2D_239[0][0]          
__________________________________________________________________________________________________
Convolution2D_6 (Conv2D)        (None, 26, 26, 64)   12352       Convolution2D_4[0][0]            
__________________________________________________________________________________________________
MaxPooling2D_7 (MaxPooling2D)   (None, 13, 13, 192)  0           Convolution2D_239[0][0]          
__________________________________________________________________________________________________
Convolution2D_8 (Conv2D)        (None, 13, 26, 64)   6208        Convolution2D_2[0][0]            
__________________________________________________________________________________________________
Convolution2D_5 (Conv2D)        (None, 13, 26, 64)   12352       Convolution2D_6[0][0]            
__________________________________________________________________________________________________
Convolution2D_10 (Conv2D)       (None, 13, 13, 64)   12352       MaxPooling2D_7[0][0]             
__________________________________________________________________________________________________
Convolution2D_9 (Conv2D)        (None, 13, 13, 64)   12352       Convolution2D_8[0][0]            
__________________________________________________________________________________________________
Convolution2D_7 (Conv2D)        (None, 13, 13, 64)   12352       Convolution2D_5[0][0]            
__________________________________________________________________________________________________
Convolution2D_3 (Conv2D)        (None, 13, 13, 32)   6176        Convolution2D_239[0][0]          
__________________________________________________________________________________________________
merge_1 (Concatenate)           (None, 13, 13, 224)  0           Convolution2D_10[0][0]           
                                                                 Convolution2D_9[0][0]            
                                                                 Convolution2D_7[0][0]            
                                                                 Convolution2D_3[0][0]            
__________________________________________________________________________________________________
MaxPooling2D_70 (MaxPooling2D)  (None, 1, 1, 224)    0           merge_1[0][0]                    
__________________________________________________________________________________________________
Flatten_5 (Flatten)             (None, 224)          0           MaxPooling2D_70[0][0]            
__________________________________________________________________________________________________
Dense_14 (Dense)                (None, 5)            1125        Flatten_5[0][0]                  
__________________________________________________________________________________________________
Dense_2 (Dense)                 (None, 5)            30          Dense_14[0][0]                   
==================================================================================================
Total params: 307,091
Trainable params: 307,091
Non-trainable params: 0